# Список заключается в квадратных скобках
list_1 = [1, 'apple', 'book', .05, ['a', 'b']]# Может содержать разные типы данных, в том числе и списки...
print(list_1)
# Кортеж - Кортеж - не изменяемый список
tuple_1 = 1, 2, "a", ['b', 'c']# Может содержать разыне типы данных, в том числе и списки...
tuple_2 = (1, 2, "a", ['b', 'c'])# Еще один способ создания кортежа
tuple_3 = tuple([1, 2, "a", ['b', 'c']])# Канонический способ создания Кортежа
print(tuple_1)
print(tuple_2)
print(tuple_3)

# Словарь набор пар данных - key : value в фигурных скобках
dict_1 = {'Paul' : 1974, 'Elena' : 1977, 'Alexa' : [1998, 11]}# Value может быть списком
print(dict_1)

#Множество - в фигурных скобках список различных значений, но будет содержать только уникальные значения
set_1 = {'a', 'b', 'c', 1, 2, 3, 'c', 3}
print(set_1)# выведет только уникальные значения

