# 1st program "Арифметика"
# Выведите на экран(в консоль) результат: возведение числа 9 в степень 0.5, после умножение на 5.
# Предполагаемый результат: 15.0
print ((9 ** .5) * 5)

# 2nd program "Логика"
# "Убедитесь в том что 9.99 больше 9.98 и 1000 не равно 1000.1 одновременно,
# выведете результат на экран(в консоль)"
# Предполагаемый результат: True
print (9.99 > 9.98 and 1000 != 1000.1)

# 3rd program "Школьная загадка"
# Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 без приоритета.
# Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 с приоритетом для сложения.
# Выведите на экран(в консоль) результат сравнения этих двух выражений.
# Предполагаемый результат (с использованием ==): False
example_one = 2 * 2 + 2
example_two = 2 * (2 +2)
print (example_one)
print (example_two)
print (example_one == example_two)

# 4th program "Первый после точки"
# Дана строка '123.456'.
# Вывести на экран первую цифру после запятой - 4.
str_one = '123.456'
print ([4])
